-- phpMyAdmin SQL Dump
-- version 4.0.10.6
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1:3306
-- Время создания: Авг 14 2015 г., 07:14
-- Версия сервера: 5.5.41-log
-- Версия PHP: 5.6.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `sandbox`
--

-- --------------------------------------------------------

--
-- Структура таблицы `news`
--

CREATE TABLE IF NOT EXISTS `news` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `dt` date NOT NULL,
  `body` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=32 ;

--
-- Дамп данных таблицы `news`
--

INSERT INTO `news` (`id`, `title`, `dt`, `body`) VALUES
(25, 'Hello World!', '2015-08-16', 'Перша новина :)......'),
(26, '«Білі хакери» навчилися керувати Chevrolet Corvette через СМС', '2015-08-02', 'Команда дослідників з університету Каліфорнії змогла дистанційно керувати системами Chevrolet Corvette за допомогою СМС. Про це повідомляє Wired.\r\n\r\nПроводячи тестування систем безпеки , хакери виявили уразливість, яка може дозволити зловмисникам керувати будь-якою легковою машиною або вантажівкою, якщо в них використовуються ключі-заглушки, що вставляються в діагностичний порт бортового комп''ютера. Такі пристрої зазвичай встановлюють страховики і компанії, що займаються вантажними автоперевезеннями, щоб мати можливість виміряти ефективність витрачання пального і пройдену відстань.\r\n\r\n«Ми роздобули кілька таких пристроїв, розібрали програми на складові їх коди і виявили чимало дефектів в системі безпеки», - прокоментував експеримент чільник команди дослідників професор Стівен Севедж, який викладає комп''ютерні науки в університеті Каліфорнії.'),
(27, 'Творця Linux розсмішили страхи Стівена Хокінга та Ілона Маска', '2015-08-24', 'Творець операційної системи Linux критично відгукнувся про страхи Стівена Хокінга, Ілона Маска і деяких інших учасників IT-галузі, які всерйоз побоюються повстання машин. Витяги з нещодавньої промови Лінуса Торвальдса опубліковані на ресурсі Gizmodo.\r\n\r\nЗокрема, на питання про можливість непередбачуваного розвитку штучного інтелекту, про що в останній рік говорили Білл Гейтс, Ілон Маск і навіть Стівен Хокінг, Торвальдс відповів фразою: «Це з розділу наукової фантастики. І, варто визнати, фантастики не кращої якості. На яких препаратах сидять ці люди? »\r\n\r\nПрограміст не вважає можливим розвиток штучного інтелекту, який дійсно міг би поневолити людство. Замість роздумів на цю тему Торвальдс запропонував звернути увагу на будь-який існуючий штучний інтелект і оцінити його дію. Як правило, це дуже обмежені і не здатні до саморозвитку програмні продукти, що допомагають переводити промову з однієї мови на іншу або планувати розклад на тиждень.'),
(28, 'Smarty Test', '2015-08-16', ':))'),
(30, 'Edit/Update Test', '2015-08-09', 'It`s worked??\r\nUPD:Yes.');

-- --------------------------------------------------------

--
-- Структура таблицы `testdrive`
--

CREATE TABLE IF NOT EXISTS `testdrive` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=3 ;

--
-- Дамп данных таблицы `testdrive`
--

INSERT INTO `testdrive` (`id`, `name`) VALUES
(1, 'Привіт,світ!'),
(2, 'Ось і я');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
